const yamadabatStats=[
    {
      "年度": "2002",
      "チーム名": "ヤクルト",
      "打率": ".164",
      "試合": "30",
      "打席": "62",
      "打数": "55",
      "安打": "9",
      "二塁打": "0",
      "三塁打": "0",
      "本塁打": "0",
      "塁打": "9",
      "打点": "2",
      "得点": "2",
      "三振": "17",
      "四球": "0",
      "死球": "0",
      "犠打": "7",
      "犠飛": "0",
      "盗塁": "0",
      "盗塁死": "0",
      "併殺打": "0",
      "出塁率": ".164",
      "長打率": ".164",
      "ＯＰＳ": ".327",
      "得点圏": ".083",
      "失策": "0"
    },
    {
      "年度": "2003",
      "チーム名": "ヤクルト",
      "打率": ".222",
      "試合": "32",
      "打席": "73",
      "打数": "63",
      "安打": "14",
      "二塁打": "1",
      "三塁打": "0",
      "本塁打": "0",
      "塁打": "15",
      "打点": "4",
      "得点": "4",
      "三振": "18",
      "四球": "0",
      "死球": "1",
      "犠打": "9",
      "犠飛": "0",
      "盗塁": "0",
      "盗塁死": "0",
      "併殺打": "0",
      "出塁率": ".234",
      "長打率": ".238",
      "ＯＰＳ": ".472",
      "得点圏": ".385",
      "失策": "2"
    },
    {
      "年度": "2004",
      "チーム名": "ヤクルト",
      "打率": ".200",
      "試合": "29",
      "打席": "59",
      "打数": "50",
      "安打": "10",
      "二塁打": "1",
      "三塁打": "0",
      "本塁打": "0",
      "塁打": "11",
      "打点": "4",
      "得点": "3",
      "三振": "20",
      "四球": "0",
      "死球": "1",
      "犠打": "8",
      "犠飛": "0",
      "盗塁": "0",
      "盗塁死": "0",
      "併殺打": "0",
      "出塁率": ".216",
      "長打率": ".220",
      "ＯＰＳ": ".436",
      "得点圏": ".273",
      "失策": "1"
    },
    {
      "年度": "2005",
      "チーム名": "ヤクルト",
      "打率": ".170",
      "試合": "26",
      "打席": "49",
      "打数": "47",
      "安打": "8",
      "二塁打": "0",
      "三塁打": "0",
      "本塁打": "0",
      "塁打": "8",
      "打点": "3",
      "得点": "4",
      "三振": "13",
      "四球": "0",
      "死球": "0",
      "犠打": "2",
      "犠飛": "0",
      "盗塁": "0",
      "盗塁死": "0",
      "併殺打": "0",
      "出塁率": ".170",
      "長打率": ".170",
      "ＯＰＳ": ".340",
      "得点圏": ".118",
      "失策": "0"
    },
    {
      "年度": "2006",
      "チーム名": "ヤクルト",
      "打率": ".068",
      "試合": "31",
      "打席": "52",
      "打数": "44",
      "安打": "3",
      "二塁打": "0",
      "三塁打": "0",
      "本塁打": "0",
      "塁打": "3",
      "打点": "0",
      "得点": "2",
      "三振": "17",
      "四球": "1",
      "死球": "0",
      "犠打": "7",
      "犠飛": "0",
      "盗塁": "0",
      "盗塁死": "0",
      "併殺打": "0",
      "出塁率": ".089",
      "長打率": ".068",
      "ＯＰＳ": ".157",
      "得点圏": ".083",
      "失策": "1"
    },
    {
      "年度": "2007",
      "チーム名": "ヤクルト",
      "打率": ".273",
      "試合": "27",
      "打席": "24",
      "打数": "22",
      "安打": "6",
      "二塁打": "0",
      "三塁打": "0",
      "本塁打": "0",
      "塁打": "6",
      "打点": "2",
      "得点": "1",
      "三振": "4",
      "四球": "1",
      "死球": "0",
      "犠打": "1",
      "犠飛": "0",
      "盗塁": "0",
      "盗塁死": "0",
      "併殺打": "0",
      "出塁率": ".304",
      "長打率": ".273",
      "ＯＰＳ": ".577",
      "得点圏": ".500",
      "失策": "0"
    },
    {
      "年度": "2008",
      "チーム名": "ヤクルト",
      "打率": ".170",
      "試合": "31",
      "打席": "64",
      "打数": "53",
      "安打": "9",
      "二塁打": "1",
      "三塁打": "0",
      "本塁打": "0",
      "塁打": "10",
      "打点": "3",
      "得点": "2",
      "三振": "15",
      "四球": "1",
      "死球": "0",
      "犠打": "10",
      "犠飛": "0",
      "盗塁": "0",
      "盗塁死": "0",
      "併殺打": "0",
      "出塁率": ".185",
      "長打率": ".189",
      "ＯＰＳ": ".374",
      "得点圏": ".143",
      "失策": "1"
    },
    {
      "年度": "2009",
      "チーム名": "ヤクルト",
      "打率": ".154",
      "試合": "30",
      "打席": "66",
      "打数": "52",
      "安打": "8",
      "二塁打": "0",
      "三塁打": "0",
      "本塁打": "0",
      "塁打": "8",
      "打点": "0",
      "得点": "3",
      "三振": "17",
      "四球": "1",
      "死球": "0",
      "犠打": "13",
      "犠飛": "0",
      "盗塁": "0",
      "盗塁死": "0",
      "併殺打": "1",
      "出塁率": ".170",
      "長打率": ".154",
      "ＯＰＳ": ".324",
      "得点圏": ".067",
      "失策": "0"
    },
    {
      "年度": "2010",
      "チーム名": "ヤクルト",
      "打率": ".145",
      "試合": "29",
      "打席": "67",
      "打数": "55",
      "安打": "8",
      "二塁打": "1",
      "三塁打": "0",
      "本塁打": "0",
      "塁打": "9",
      "打点": "5",
      "得点": "3",
      "三振": "17",
      "四球": "5",
      "死球": "0",
      "犠打": "7",
      "犠飛": "0",
      "盗塁": "0",
      "盗塁死": "0",
      "併殺打": "0",
      "出塁率": ".217",
      "長打率": ".164",
      "ＯＰＳ": ".380",
      "得点圏": ".263",
      "失策": "1"
    },
    {
      "年度": "2011",
      "チーム名": "ヤクルト",
      "打率": ".109",
      "試合": "27",
      "打席": "58",
      "打数": "46",
      "安打": "5",
      "二塁打": "0",
      "三塁打": "0",
      "本塁打": "0",
      "塁打": "5",
      "打点": "1",
      "得点": "2",
      "三振": "13",
      "四球": "2",
      "死球": "0",
      "犠打": "10",
      "犠飛": "0",
      "盗塁": "0",
      "盗塁死": "0",
      "併殺打": "0",
      "出塁率": ".146",
      "長打率": ".109",
      "ＯＰＳ": ".255",
      "得点圏": ".125",
      "失策": "3"
    },
    {
      "年度": "2012",
      "チーム名": "ヤクルト",
      "打率": ".213",
      "試合": "27",
      "打席": "56",
      "打数": "47",
      "安打": "10",
      "二塁打": "0",
      "三塁打": "0",
      "本塁打": "0",
      "塁打": "10",
      "打点": "0",
      "得点": "4",
      "三振": "8",
      "四球": "0",
      "死球": "0",
      "犠打": "9",
      "犠飛": "0",
      "盗塁": "0",
      "盗塁死": "0",
      "併殺打": "0",
      "出塁率": ".213",
      "長打率": ".213",
      "ＯＰＳ": ".426",
      "得点圏": ".214",
      "失策": "1"
    },
    {
      "年度": "2013",
      "チーム名": "ヤクルト",
      "打率": ".158",
      "試合": "24",
      "打席": "46",
      "打数": "38",
      "安打": "6",
      "二塁打": "0",
      "三塁打": "0",
      "本塁打": "0",
      "塁打": "6",
      "打点": "1",
      "得点": "1",
      "三振": "11",
      "四球": "1",
      "死球": "0",
      "犠打": "7",
      "犠飛": "0",
      "盗塁": "0",
      "盗塁死": "0",
      "併殺打": "0",
      "出塁率": ".179",
      "長打率": ".158",
      "ＯＰＳ": ".337",
      "得点圏": ".273",
      "失策": "2"
    },
    {
      "年度": "2014",
      "チーム名": "ヤクルト",
      "打率": ".205",
      "試合": "27",
      "打席": "56",
      "打数": "44",
      "安打": "9",
      "二塁打": "0",
      "三塁打": "0",
      "本塁打": "0",
      "塁打": "9",
      "打点": "2",
      "得点": "2",
      "三振": "15",
      "四球": "1",
      "死球": "0",
      "犠打": "11",
      "犠飛": "0",
      "盗塁": "0",
      "盗塁死": "0",
      "併殺打": "1",
      "出塁率": ".222",
      "長打率": ".205",
      "ＯＰＳ": ".427",
      "得点圏": ".154",
      "失策": "0"
    },
    {
      "年度": "2015",
      "チーム名": "ヤクルト",
      "打率": ".184",
      "試合": "25",
      "打席": "47",
      "打数": "38",
      "安打": "7",
      "二塁打": "0",
      "三塁打": "0",
      "本塁打": "0",
      "塁打": "7",
      "打点": "1",
      "得点": "2",
      "三振": "13",
      "四球": "2",
      "死球": "0",
      "犠打": "7",
      "犠飛": "0",
      "盗塁": "0",
      "盗塁死": "0",
      "併殺打": "1",
      "出塁率": ".225",
      "長打率": ".184",
      "ＯＰＳ": ".409",
      "得点圏": ".222",
      "失策": "0"
    },
    {
      "年度": "2016",
      "チーム名": "ヤクルト",
      "打率": ".029",
      "試合": "20",
      "打席": "39",
      "打数": "34",
      "安打": "1",
      "二塁打": "0",
      "三塁打": "0",
      "本塁打": "0",
      "塁打": "1",
      "打点": "0",
      "得点": "0",
      "三振": "12",
      "四球": "1",
      "死球": "0",
      "犠打": "4",
      "犠飛": "0",
      "盗塁": "0",
      "盗塁死": "0",
      "併殺打": "1",
      "出塁率": ".057",
      "長打率": ".029",
      "ＯＰＳ": ".087",
      "得点圏": ".000",
      "失策": "0"
    },
    {
      "年度": "2017",
      "チーム名": "ヤクルト",
      "打率": ".034",
      "試合": "23",
      "打席": "36",
      "打数": "29",
      "安打": "1",
      "二塁打": "0",
      "三塁打": "0",
      "本塁打": "0",
      "塁打": "1",
      "打点": "2",
      "得点": "0",
      "三振": "11",
      "四球": "0",
      "死球": "0",
      "犠打": "7",
      "犠飛": "0",
      "盗塁": "0",
      "盗塁死": "0",
      "併殺打": "0",
      "出塁率": ".034",
      "長打率": ".034",
      "ＯＰＳ": ".069",
      "得点圏": ".000",
      "失策": "0"
    },
    {
      "年度": "2018",
      "チーム名": "ヤクルト",
      "打率": ".065",
      "試合": "22",
      "打席": "39",
      "打数": "31",
      "安打": "2",
      "二塁打": "0",
      "三塁打": "0",
      "本塁打": "0",
      "塁打": "2",
      "打点": "0",
      "得点": "2",
      "三振": "9",
      "四球": "2",
      "死球": "0",
      "犠打": "6",
      "犠飛": "0",
      "盗塁": "0",
      "盗塁死": "0",
      "併殺打": "0",
      "出塁率": ".121",
      "長打率": ".065",
      "ＯＰＳ": ".186",
      "得点圏": ".000",
      "失策": "1"
    },
    {
      "年度": "2019",
      "チーム名": "ヤクルト",
      "打率": ".235",
      "試合": "23",
      "打席": "41",
      "打数": "34",
      "安打": "8",
      "二塁打": "0",
      "三塁打": "0",
      "本塁打": "0",
      "塁打": "8",
      "打点": "4",
      "得点": "3",
      "三振": "8",
      "四球": "1",
      "死球": "0",
      "犠打": "6",
      "犠飛": "0",
      "盗塁": "0",
      "盗塁死": "0",
      "併殺打": "0",
      "出塁率": ".257",
      "長打率": ".235",
      "ＯＰＳ": ".492",
      "得点圏": ".286",
      "失策": "0"
    },
    {
      "年度": "2020",
      "チーム名": "ヤクルト",
      "打率": ".042",
      "試合": "15",
      "打席": "27",
      "打数": "24",
      "安打": "1",
      "二塁打": "0",
      "三塁打": "0",
      "本塁打": "0",
      "塁打": "1",
      "打点": "0",
      "得点": "0",
      "三振": "9",
      "四球": "1",
      "死球": "0",
      "犠打": "2",
      "犠飛": "0",
      "盗塁": "0",
      "盗塁死": "0",
      "併殺打": "0",
      "出塁率": ".080",
      "長打率": ".042",
      "ＯＰＳ": ".122",
      "得点圏": ".000",
      "失策": "0"
    },
    {
      "年度": "2021",
      "チーム名": "ヤクルト",
      "打率": ".222",
      "試合": "17",
      "打席": "25",
      "打数": "18",
      "安打": "4",
      "二塁打": "0",
      "三塁打": "0",
      "本塁打": "0",
      "塁打": "4",
      "打点": "1",
      "得点": "1",
      "三振": "5",
      "四球": "1",
      "死球": "0",
      "犠打": "6",
      "犠飛": "0",
      "盗塁": "0",
      "盗塁死": "0",
      "併殺打": "0",
      "出塁率": ".263",
      "長打率": ".222",
      "ＯＰＳ": ".485",
      "得点圏": ".250",
      "失策": "0"
    },
    {
      "年度": "2022",
      "チーム名": "ヤクルト",
      "打率": ".100",
      "試合": "16",
      "打席": "26",
      "打数": "20",
      "安打": "2",
      "二塁打": "0",
      "三塁打": "0",
      "本塁打": "0",
      "塁打": "2",
      "打点": "0",
      "得点": "0",
      "三振": "3",
      "四球": "2",
      "死球": "0",
      "犠打": "4",
      "犠飛": "0",
      "盗塁": "0",
      "盗塁死": "0",
      "併殺打": "0",
      "出塁率": ".182",
      "長打率": ".100",
      "ＯＰＳ": ".282",
      "得点圏": ".143",
      "失策": "0"
    },
    {
      "年度": "2023",
      "チーム名": "ヤクルト",
      "打率": ".250",
      "試合": "13",
      "打席": "16",
      "打数": "12",
      "安打": "3",
      "二塁打": "0",
      "三塁打": "0",
      "本塁打": "0",
      "塁打": "3",
      "打点": "0",
      "得点": "0",
      "三振": "3",
      "四球": "0",
      "死球": "0",
      "犠打": "4",
      "犠飛": "0",
      "盗塁": "0",
      "盗塁死": "0",
      "併殺打": "0",
      "出塁率": ".250",
      "長打率": ".250",
      "ＯＰＳ": ".500",
      "得点圏": ".000",
      "失策": "1"
    },
    {
      "年度": "2024",
      "チーム名": "ヤクルト",
      "打率": ".111",
      "試合": "9",
      "打席": "12",
      "打数": "9",
      "安打": "1",
      "二塁打": "0",
      "三塁打": "0",
      "本塁打": "0",
      "塁打": "1",
      "打点": "0",
      "得点": "0",
      "三振": "4",
      "四球": "0",
      "死球": "0",
      "犠打": "3",
      "犠飛": "0",
      "盗塁": "0",
      "盗塁死": "0",
      "併殺打": "0",
      "出塁率": ".111",
      "長打率": ".111",
      "ＯＰＳ": ".222",
      "得点圏": ".000",
      "失策": "1"
    },
    {
        "年度": "通算成績",
        "チーム名": " ",
        "打率": ".156",
        "試合": "553",
        "打席": "1040",
        "打数": "865",
        "安打": "135",
        "二塁打": "4",
        "三塁打": "0",
        "本塁打": "0",
        "塁打": "139",
        "打点": "35",
        "得点": "41",
        "三振": "262",
        "四球": "23",
        "死球": "2",
        "犠打": "150",
        "犠飛": "0",
        "盗塁": "0",
        "盗塁死": "0",
        "併殺打": "4",
        "出塁率": ".180",
        "長打率": ".161",
        "ＯＰＳ": ".340",
        "得点圏": ".170",
        "失策": "15"
      }
  ];
const yamadapitStats =[
    {
      "年度": "2002",
      "チーム名": "ヤクルト",
      "防御率": "3.33",
      "登板": "29",
      "先発": "28",
      "完投": "2",
      "完封": "0",
      "無四球": "2",
      "交代完了": "0",
      "勝利": "12",
      "敗戦": "9",
      "ホールド": "0",
      "ＨＰ": "0",
      "セーブ": "0",
      "勝率": ".571",
      "投球回": "178.1",
      "打者": "735",
      "被安打": "183",
      "被本塁打": "20",
      "奪三振": "104",
      "奪三振率": "5.25",
      "与四球": "29",
      "与死球": "2",
      "暴投": "5",
      "ボーク": "3",
      "失点": "76",
      "自責点": "66",
      "被打率": ".268",
      "Ｋ／ＢＢ": "3.59",
      "ＷＨＩＰ": "1.19"
    },
    {
      "年度": "2003",
      "チーム名": "ヤクルト",
      "防御率": "3.79",
      "登板": "30",
      "先発": "30",
      "完投": "3",
      "完封": "0",
      "無四球": "2",
      "交代完了": "0",
      "勝利": "12",
      "敗戦": "11",
      "ホールド": "0",
      "ＨＰ": "0",
      "セーブ": "0",
      "勝率": ".522",
      "投球回": "190",
      "打者": "793",
      "被安打": "201",
      "被本塁打": "21",
      "奪三振": "97",
      "奪三振率": "4.59",
      "与四球": "33",
      "与死球": "7",
      "暴投": "3",
      "ボーク": "1",
      "失点": "88",
      "自責点": "80",
      "被打率": ".276",
      "Ｋ／ＢＢ": "2.94",
      "ＷＨＩＰ": "1.23"
    },
    {
      "年度": "2004",
      "チーム名": "ヤクルト",
      "防御率": "4.35",
      "登板": "27",
      "先発": "27",
      "完投": "1",
      "完封": "0",
      "無四球": "0",
      "交代完了": "0",
      "勝利": "11",
      "敗戦": "11",
      "ホールド": "0",
      "ＨＰ": "0",
      "セーブ": "0",
      "勝率": ".500",
      "投球回": "163.1",
      "打者": "708",
      "被安打": "200",
      "被本塁打": "21",
      "奪三振": "72",
      "奪三振率": "3.97",
      "与四球": "22",
      "与死球": "5",
      "暴投": "4",
      "ボーク": "1",
      "失点": "90",
      "自責点": "79",
      "被打率": ".300",
      "Ｋ／ＢＢ": "3.27",
      "ＷＨＩＰ": "1.36"
    },
    {
      "年度": "2005",
      "チーム名": "ヤクルト",
      "防御率": "4.87",
      "登板": "26",
      "先発": "25",
      "完投": "0",
      "完封": "0",
      "無四球": "0",
      "交代完了": "0",
      "勝利": "10",
      "敗戦": "8",
      "ホールド": "0",
      "ＨＰ": "0",
      "セーブ": "0",
      "勝率": ".556",
      "投球回": "149.2",
      "打者": "637",
      "被安打": "180",
      "被本塁打": "18",
      "奪三振": "105",
      "奪三振率": "6.31",
      "与四球": "24",
      "与死球": "4",
      "暴投": "7",
      "ボーク": "0",
      "失点": "82",
      "自責点": "81",
      "被打率": ".301",
      "Ｋ／ＢＢ": "4.38",
      "ＷＨＩＰ": "1.36"
    },
    {
      "年度": "2006",
      "チーム名": "ヤクルト",
      "防御率": "4.53",
      "登板": "29",
      "先発": "28",
      "完投": "0",
      "完封": "0",
      "無四球": "0",
      "交代完了": "0",
      "勝利": "10",
      "敗戦": "10",
      "ホールド": "0",
      "ＨＰ": "0",
      "セーブ": "0",
      "勝率": ".500",
      "投球回": "151",
      "打者": "648",
      "被安打": "191",
      "被本塁打": "12",
      "奪三振": "81",
      "奪三振率": "4.83",
      "与四球": "17",
      "与死球": "3",
      "暴投": "4",
      "ボーク": "0",
      "失点": "82",
      "自責点": "76",
      "被打率": ".310",
      "Ｋ／ＢＢ": "4.76",
      "ＷＨＩＰ": "1.38"
    },
    {
      "年度": "2007",
      "チーム名": "ヤクルト",
      "防御率": "4.38",
      "登板": "26",
      "先発": "15",
      "完投": "3",
      "完封": "2",
      "無四球": "2",
      "交代完了": "5",
      "勝利": "4",
      "敗戦": "7",
      "ホールド": "2",
      "ＨＰ": "3",
      "セーブ": "0",
      "勝率": ".364",
      "投球回": "96.2",
      "打者": "405",
      "被安打": "104",
      "被本塁打": "15",
      "奪三振": "50",
      "奪三振率": "4.66",
      "与四球": "16",
      "与死球": "5",
      "暴投": "2",
      "ボーク": "0",
      "失点": "51",
      "自責点": "47",
      "被打率": ".277",
      "Ｋ／ＢＢ": "3.13",
      "ＷＨＩＰ": "1.24"
    },
    {
      "年度": "2008",
      "チーム名": "ヤクルト",
      "防御率": "2.68",
      "登板": "30",
      "先発": "29",
      "完投": "3",
      "完封": "1",
      "無四球": "2",
      "交代完了": "0",
      "勝利": "12",
      "敗戦": "10",
      "ホールド": "1",
      "ＨＰ": "1",
      "セーブ": "0",
      "勝率": ".545",
      "投球回": "195",
      "打者": "792",
      "被安打": "180",
      "被本塁打": "21",
      "奪三振": "112",
      "奪三振率": "5.17",
      "与四球": "41",
      "与死球": "4",
      "暴投": "2",
      "ボーク": "0",
      "失点": "59",
      "自責点": "58",
      "被打率": ".250",
      "Ｋ／ＢＢ": "2.73",
      "ＷＨＩＰ": "1.13"
    },
    {
      "年度": "2009",
      "チーム名": "ヤクルト",
      "防御率": "3.54",
      "登板": "29",
      "先発": "29",
      "完投": "3",
      "完封": "0",
      "無四球": "0",
      "交代完了": "0",
      "勝利": "13",
      "敗戦": "7",
      "ホールド": "0",
      "ＨＰ": "0",
      "セーブ": "0",
      "勝率": ".650",
      "投球回": "198.1",
      "打者": "810",
      "被安打": "203",
      "被本塁打": "25",
      "奪三振": "84",
      "奪三振率": "3.81",
      "与四球": "28",
      "与死球": "6",
      "暴投": "4",
      "ボーク": "0",
      "失点": "81",
      "自責点": "78",
      "被打率": ".270",
      "Ｋ／ＢＢ": "3.00",
      "ＷＨＩＰ": "1.16"
    },
    {
      "年度": "2010",
      "チーム名": "ヤクルト",
      "防御率": "3.53",
      "登板": "28",
      "先発": "28",
      "完投": "2",
      "完封": "1",
      "無四球": "1",
      "交代完了": "0",
      "勝利": "13",
      "敗戦": "8",
      "ホールド": "0",
      "ＨＰ": "0",
      "セーブ": "0",
      "勝率": ".619",
      "投球回": "186.1",
      "打者": "783",
      "被安打": "209",
      "被本塁打": "20",
      "奪三振": "98",
      "奪三振率": "4.73",
      "与四球": "27",
      "与死球": "7",
      "暴投": "9",
      "ボーク": "0",
      "失点": "81",
      "自責点": "73",
      "被打率": ".288",
      "Ｋ／ＢＢ": "3.63",
      "ＷＨＩＰ": "1.27"
    },
    {
      "年度": "2011",
      "チーム名": "ヤクルト",
      "防御率": "2.73",
      "登板": "27",
      "先発": "27",
      "完投": "1",
      "完封": "0",
      "無四球": "0",
      "交代完了": "0",
      "勝利": "10",
      "敗戦": "9",
      "ホールド": "0",
      "ＨＰ": "0",
      "セーブ": "0",
      "勝率": ".526",
      "投球回": "178.1",
      "打者": "731",
      "被安打": "168",
      "被本塁打": "18",
      "奪三振": "127",
      "奪三振率": "6.41",
      "与四球": "42",
      "与死球": "5",
      "暴投": "1",
      "ボーク": "0",
      "失点": "57",
      "自責点": "54",
      "被打率": ".256",
      "Ｋ／ＢＢ": "3.02",
      "ＷＨＩＰ": "1.18"
    },
    {
      "年度": "2012",
      "チーム名": "ヤクルト",
      "防御率": "3.60",
      "登板": "27",
      "先発": "27",
      "完投": "2",
      "完封": "1",
      "無四球": "0",
      "交代完了": "0",
      "勝利": "8",
      "敗戦": "11",
      "ホールド": "0",
      "ＨＰ": "0",
      "セーブ": "0",
      "勝率": ".421",
      "投球回": "172.2",
      "打者": "721",
      "被安打": "175",
      "被本塁打": "14",
      "奪三振": "100",
      "奪三振率": "5.21",
      "与四球": "41",
      "与死球": "5",
      "暴投": "4",
      "ボーク": "0",
      "失点": "77",
      "自責点": "69",
      "被打率": ".268",
      "Ｋ／ＢＢ": "2.44",
      "ＷＨＩＰ": "1.25"
    },
    {
      "年度": "2013",
      "チーム名": "ヤクルト",
      "防御率": "3.52",
      "登板": "24",
      "先発": "24",
      "完投": "2",
      "完封": "0",
      "無四球": "1",
      "交代完了": "0",
      "勝利": "6",
      "敗戦": "9",
      "ホールド": "0",
      "ＨＰ": "0",
      "セーブ": "0",
      "勝率": ".400",
      "投球回": "148.1",
      "打者": "623",
      "被安打": "149",
      "被本塁打": "15",
      "奪三振": "85",
      "奪三振率": "5.16",
      "与四球": "33",
      "与死球": "6",
      "暴投": "6",
      "ボーク": "1",
      "失点": "73",
      "自責点": "58",
      "被打率": ".264",
      "Ｋ／ＢＢ": "2.58",
      "ＷＨＩＰ": "1.23"
    },
    {
      "年度": "2014",
      "チーム名": "ヤクルト",
      "防御率": "4.75",
      "登板": "27",
      "先発": "27",
      "完投": "2",
      "完封": "2",
      "無四球": "0",
      "交代完了": "0",
      "勝利": "10",
      "敗戦": "10",
      "ホールド": "0",
      "ＨＰ": "0",
      "セーブ": "0",
      "勝率": ".500",
      "投球回": "165",
      "打者": "725",
      "被安打": "181",
      "被本塁打": "20",
      "奪三振": "101",
      "奪三振率": "5.51",
      "与四球": "49",
      "与死球": "6",
      "暴投": "2",
      "ボーク": "0",
      "失点": "97",
      "自責点": "87",
      "被打率": ".278",
      "Ｋ／ＢＢ": "2.06",
      "ＷＨＩＰ": "1.39"
    },
    {
      "年度": "2015",
      "チーム名": "ヤクルト",
      "防御率": "3.31",
      "登板": "25",
      "先発": "25",
      "完投": "1",
      "完封": "1",
      "無四球": "1",
      "交代完了": "0",
      "勝利": "13",
      "敗戦": "9",
      "ホールド": "0",
      "ＨＰ": "0",
      "セーブ": "0",
      "勝率": ".591",
      "投球回": "146.2",
      "打者": "598",
      "被安打": "150",
      "被本塁打": "16",
      "奪三振": "90",
      "奪三振率": "5.52",
      "与四球": "28",
      "与死球": "3",
      "暴投": "3",
      "ボーク": "0",
      "失点": "59",
      "自責点": "54",
      "被打率": ".272",
      "Ｋ／ＢＢ": "3.21",
      "ＷＨＩＰ": "1.21"
    },
    {
      "年度": "2016",
      "チーム名": "ヤクルト",
      "防御率": "4.47",
      "登板": "20",
      "先発": "20",
      "完投": "0",
      "完封": "0",
      "無四球": "0",
      "交代完了": "0",
      "勝利": "8",
      "敗戦": "8",
      "ホールド": "0",
      "ＨＰ": "0",
      "セーブ": "0",
      "勝率": ".500",
      "投球回": "116.2",
      "打者": "500",
      "被安打": "126",
      "被本塁打": "15",
      "奪三振": "52",
      "奪三振率": "4.01",
      "与四球": "33",
      "与死球": "2",
      "暴投": "3",
      "ボーク": "1",
      "失点": "59",
      "自責点": "58",
      "被打率": ".281",
      "Ｋ／ＢＢ": "1.58",
      "ＷＨＩＰ": "1.36"
    },
    {
      "年度": "2017",
      "チーム名": "ヤクルト",
      "防御率": "5.11",
      "登板": "23",
      "先発": "23",
      "完投": "0",
      "完封": "0",
      "無四球": "0",
      "交代完了": "0",
      "勝利": "4",
      "敗戦": "14",
      "ホールド": "0",
      "ＨＰ": "0",
      "セーブ": "0",
      "勝率": ".222",
      "投球回": "123.1",
      "打者": "540",
      "被安打": "149",
      "被本塁打": "18",
      "奪三振": "88",
      "奪三振率": "6.42",
      "与四球": "28",
      "与死球": "4",
      "暴投": "2",
      "ボーク": "1",
      "失点": "72",
      "自責点": "70",
      "被打率": ".303",
      "Ｋ／ＢＢ": "3.14",
      "ＷＨＩＰ": "1.44"
    },
    {
      "年度": "2018",
      "チーム名": "ヤクルト",
      "防御率": "4.88",
      "登板": "22",
      "先発": "22",
      "完投": "0",
      "完封": "0",
      "無四球": "0",
      "交代完了": "0",
      "勝利": "7",
      "敗戦": "6",
      "ホールド": "0",
      "ＨＰ": "0",
      "セーブ": "0",
      "勝率": ".538",
      "投球回": "110.2",
      "打者": "488",
      "被安打": "121",
      "被本塁打": "19",
      "奪三振": "78",
      "奪三振率": "6.34",
      "与四球": "41",
      "与死球": "4",
      "暴投": "2",
      "ボーク": "0",
      "失点": "70",
      "自責点": "60",
      "被打率": ".280",
      "Ｋ／ＢＢ": "1.90",
      "ＷＨＩＰ": "1.46"
    },
    {
      "年度": "2019",
      "チーム名": "ヤクルト",
      "防御率": "3.84",
      "登板": "23",
      "先発": "23",
      "完投": "0",
      "完封": "0",
      "無四球": "0",
      "交代完了": "0",
      "勝利": "8",
      "敗戦": "6",
      "ホールド": "0",
      "ＨＰ": "0",
      "セーブ": "0",
      "勝率": ".571",
      "投球回": "124.1",
      "打者": "514",
      "被安打": "117",
      "被本塁打": "18",
      "奪三振": "88",
      "奪三振率": "6.37",
      "与四球": "26",
      "与死球": "4",
      "暴投": "2",
      "ボーク": "1",
      "失点": "57",
      "自責点": "53",
      "被打率": ".246",
      "Ｋ／ＢＢ": "3.38",
      "ＷＨＩＰ": "1.15"
    },
    {
      "年度": "2020",
      "チーム名": "ヤクルト",
      "防御率": "4.48",
      "登板": "15",
      "先発": "15",
      "完投": "0",
      "完封": "0",
      "無四球": "0",
      "交代完了": "0",
      "勝利": "2",
      "敗戦": "8",
      "ホールド": "0",
      "ＨＰ": "0",
      "セーブ": "0",
      "勝率": ".200",
      "投球回": "76.1",
      "打者": "331",
      "被安打": "85",
      "被本塁打": "7",
      "奪三振": "41",
      "奪三振率": "4.83",
      "与四球": "19",
      "与死球": "2",
      "暴投": "2",
      "ボーク": "0",
      "失点": "40",
      "自責点": "38",
      "被打率": ".284",
      "Ｋ／ＢＢ": "2.16",
      "ＷＨＩＰ": "1.36"
    },
    {
      "年度": "2021",
      "チーム名": "ヤクルト",
      "防御率": "3.07",
      "登板": "17",
      "先発": "16",
      "完投": "1",
      "完封": "0",
      "無四球": "1",
      "交代完了": "0",
      "勝利": "4",
      "敗戦": "5",
      "ホールド": "0",
      "ＨＰ": "0",
      "セーブ": "0",
      "勝率": ".444",
      "投球回": "82",
      "打者": "335",
      "被安打": "81",
      "被本塁打": "10",
      "奪三振": "54",
      "奪三振率": "5.93",
      "与四球": "16",
      "与死球": "3",
      "暴投": "1",
      "ボーク": "0",
      "失点": "31",
      "自責点": "28",
      "被打率": ".262",
      "Ｋ／ＢＢ": "3.38",
      "ＷＨＩＰ": "1.18"
    },
    {
      "年度": "2022",
      "チーム名": "ヤクルト",
      "防御率": "4.50",
      "登板": "16",
      "先発": "16",
      "完投": "0",
      "完封": "0",
      "無四球": "0",
      "交代完了": "0",
      "勝利": "6",
      "敗戦": "4",
      "ホールド": "0",
      "ＨＰ": "0",
      "セーブ": "0",
      "勝率": ".600",
      "投球回": "84",
      "打者": "357",
      "被安打": "93",
      "被本塁打": "16",
      "奪三振": "39",
      "奪三振率": "4.18",
      "与四球": "15",
      "与死球": "3",
      "暴投": "1",
      "ボーク": "0",
      "失点": "45",
      "自責点": "42",
      "被打率": ".284",
      "Ｋ／ＢＢ": "2.60",
      "ＷＨＩＰ": "1.29"
    },
    {
      "年度": "2023",
      "チーム名": "ヤクルト",
      "防御率": "3.98",
      "登板": "13",
      "先発": "12",
      "完投": "0",
      "完封": "0",
      "無四球": "0",
      "交代完了": "0",
      "勝利": "2",
      "敗戦": "5",
      "ホールド": "0",
      "ＨＰ": "0",
      "セーブ": "0",
      "勝率": ".286",
      "投球回": "63.1",
      "打者": "267",
      "被安打": "75",
      "被本塁打": "11",
      "奪三振": "22",
      "奪三振率": "3.13",
      "与四球": "6",
      "与死球": "0",
      "暴投": "1",
      "ボーク": "0",
      "失点": "32",
      "自責点": "28",
      "被打率": ".292",
      "Ｋ／ＢＢ": "3.67",
      "ＷＨＩＰ": "1.28"
    },
    {
      "年度": "2024",
      "チーム名": "ヤクルト",
      "防御率": "4.10",
      "登板": "9",
      "先発": "8",
      "完投": "1",
      "完封": "1",
      "無四球": "1",
      "交代完了": "0",
      "勝利": "1",
      "敗戦": "4",
      "ホールド": "0",
      "ＨＰ": "0",
      "セーブ": "0",
      "勝率": ".200",
      "投球回": "37.1",
      "打者": "161",
      "被安打": "45",
      "被本塁打": "4",
      "奪三振": "10",
      "奪三振率": "2.41",
      "与四球": "6",
      "与死球": "1",
      "暴投": "1",
      "ボーク": "0",
      "失点": "20",
      "自責点": "17",
      "被打率": ".300",
      "Ｋ／ＢＢ": "1.67",
      "ＷＨＩＰ": "1.37"
    },
    {
        "年度": "通算成績",
        "チーム名": " ",
        "防御率": "3.88",
        "登板": "542",
        "先発": "524",
        "完投": "27",
        "完封": "9",
        "無四球": "13",
        "交代完了": "5",
        "勝利": "186",
        "敗戦": "189",
        "ホールド": "3",
        "ＨＰ": "4",
        "セーブ": "0",
        "勝率": ".496",
        "投球回": "3137.2",
        "打者": "13202",
        "被安打": "3366",
        "被本塁打": "374",
        "奪三振": "1778",
        "奪三振率": "5.10",
        "与四球": "620",
        "与死球": "91",
        "暴投": "71",
        "ボーク": "9",
        "失点": "1479",
        "自責点": "1354",
        "被打率": ".277",
        "Ｋ／ＢＢ": "2.87",
        "ＷＨＩＰ": "1.27"
      }
  ];

window.yamadaStatsData = {
    '2002':{kper:14.1,bbper:3.9,kbb:10.2,hrper:"-",ave:"-",der:.719,lob:74.2,ramin:97,fipmin:101,xfipmin:"-",ra:3.84,fip:4.00,r_f:-0.17,xfip:"-",tra:"-"},
    '2003':{kper:12.2,bbper:4.2,kbb:8.1,hrper:"-",ave:"-",der:.717,lob:72.3,ramin:91,fipmin:97,xfipmin:"-",ra:4.17,fip:4.17,r_f:-0.28,xfip:"-",tra:"-"},
    '2004':{kper:10.2,bbper:3.1,kbb:7.1,hrper:"-",ave:"-",der:.696,lob:69.3,ramin:104,fipmin:99,xfipmin:"-",ra:4.96,fip:4.96,r_f:0.21,xfip:"-",tra:"-"},
    '2005':{kper:16.5,bbper:3.8,kbb:12.7,hrper:"-",ave:"-",der:.667,lob:68.9,ramin:111,fipmin:93,xfipmin:"-",ra:4.93,fip:4.93,r_f:0.77,xfip:"-",tra:"-"},
    '2006':{kper:12.5,bbper:2.6,kbb:9.9,hrper:"-",ave:"-",der:.665,lob:66.4,ramin:119,fipmin:91,xfipmin:"-",ra:4.89,fip:4.89,r_f:1.15,xfip:"-",tra:"-"},
    '2007':{kper:12.3,bbper:4.0,kbb:8.4,hrper:"-",ave:"-",der:.721,lob:71.2,ramin:112,fipmin:116,xfipmin:"-",ra:4.75,fip:4.75,r_f:-0.14,xfip:"-",tra:"-"},
    '2008':{kper:14.1,bbper:5.2,kbb:9.0,hrper:"-",ave:"-",der:.741,lob:84.9,ramin:67,fipmin:103,xfipmin:"-",ra:2.72,fip:2.72,r_f:-1.49,xfip:"-",tra:"-"},
    '2009':{kper:10.4,bbper:3.5,kbb:6.9,hrper:"-",ave:"-",der:.733,lob:77.2,ramin:92,fipmin:112,xfipmin:"-",ra:3.68,fip:3.68,r_f:-0.79,xfip:"-",tra:"-"},
    '2010':{kper:12.5,bbper:3.4,kbb:9.1,hrper:"-",ave:"-",der:.700,lob:75.3,ramin:86,fipmin:95,xfipmin:"-",ra:3.91,fip:3.91,r_f:-0.38,xfip:"-",tra:"-"},
    '2011':{kper:17.4,bbper:5.7,kbb:11.6,hrper:"-",ave:.256,der:.722,lob:83.2,ramin:85,fipmin:110,xfipmin:"-",ra:2.88,fip:2.88,r_f:-0.84,xfip:"-",tra:"-"},
    '2012':{kper:13.9,bbper:5.7,kbb:8.2,hrper:"-",ave:.268,der:.713,lob:71.5,ramin:125,fipmin:110,xfipmin:"-",ra:4.01,fip:4.01,r_f:0.46,xfip:"-",tra:"-"},
    '2013':{kper:13.6,bbper:5.3,kbb:8.3,hrper:"-",ave:.264,der:.723,lob:68.9,ramin:108,fipmin:101,xfipmin:"-",ra:4.43,fip:4.43,r_f:0.30,xfip:"-",tra:"-"},
    '2014':{kper:13.9,bbper:6.8,kbb:7.2,hrper:2.8,ave:.278,der:.687,lob:66.8,ramin:123,fipmin:112,xfipmin:107,ra:5.29,fip:5.29,r_f:0.48,xfip:4.61,tra:4.90},
    '2015':{kper:15.1,bbper:4.7,kbb:10.4,hrper:2.7,ave:.272,der:.701,lob:76.9,ramin:100,fipmin:108,xfipmin:97,ra:3.62,fip:3.62,r_f:-0.31,xfip:3.51,tra:3.97},
    '2016':{kper:10.4,bbper:6.6,kbb:3.8,hrper:3.0,ave:.281,der:.711,lob:72.9,ramin:113,fipmin:122,xfipmin:116,ra:4.55,fip:4.55,r_f:-0.38,xfip:4.71,tra:5.50},
    '2017':{kper:16.3,bbper:5.2,kbb:11.1,hrper:3.3,ave:.303,der:.664,lob:70.0,ramin:130,fipmin:113,xfipmin:106,ra:5.25,fip:5.25,r_f:0.70,xfip:4.26,tra:4.66},
    '2018':{kper:16.0,bbper:8.4,kbb:7.6,hrper:3.9,ave:.280,der:.697,lob:68.9,ramin:127,fipmin:123,xfipmin:110,ra:5.69,fip:5.69,r_f:0.16,xfip:4.93,tra:5.91},
    '2019':{kper:17.1,bbper:5.1,kbb:12.1,hrper:3.5,ave:.246,der:.725,lob:73.9,ramin:97,fipmin:107,xfipmin:99,ra:4.13,fip:4.13,r_f:-0.43,xfip:4.23,tra:4.63},
    '2020':{kper:12.4,bbper:5.7,kbb:6.6,hrper:2.1,ave:.284,der:.698,lob:68.6,ramin:112,fipmin:102,xfipmin:112,ra:4.72,fip:4.72,r_f:0.45,xfip:4.72,tra:4.79},
    '2021':{kper:16.1,bbper:4.8,kbb:11.3,hrper:3.0,ave:.262,der:.702,lob:80.2,ramin:87,fipmin:106,xfipmin:102,ra:3.40,fip:3.40,r_f:-0.76,xfip:4.01,tra:4.30},
    '2022':{kper:10.9,bbper:4.2,kbb:6.7,hrper:4.5,ave:.284,der:.708,lob:74.5,ramin:130,fipmin:143,xfipmin:115,ra:4.82,fip:4.82,r_f:-0.46,xfip:4.25,tra:5.17},
    '2023':{kper:8.2,bbper:2.2,kbb:6.0,hrper:4.1,ave:.292,der:.702,lob:74.7,ramin:129,fipmin:140,xfipmin:122,ra:4.55,fip:4.55,r_f:-0.35,xfip:4.27,tra:5.46},
    '2024':{kper:6.2,bbper:3.7,kbb:2.5,hrper:2.5,ave:.300,der:.671,lob:69.0,ramin:149,fipmin:140,xfipmin:132,ra:4.82,fip:4.82,r_f:0.31,xfip:4.25,tra:4.66}
};


const yamadateamStatsByYear = {
  2022:[
      {team:'巨人',games:2, average:.000, HR:0, RBIs:0, sb:0},
      {team:'阪神',games:3, average:.167, HR:0, RBIs:0, sb:0},
      {team:'DeNA',games:2, average:.000, HR:0, RBIs:0, sb:0},
      {team:'広島',games:2, average:.000, HR:0, RBIs:0, sb:0},
      {team:'中日',games:1, average:.000, HR:0, RBIs:0, sb:0},
      {team:'通算',games:10, average:.100, HR:0, RBIs:0, sb:0},
  ],
  2023: [
  {team:'巨人',games:9, average:.250, HR:0, RBIs:0, sb:0},
  {team:'阪神',games:4, average:.500, HR:1, RBIs:1, sb:0},
  {team:'DeNA',games:7, average:.143, HR:0, RBIs:1, sb:0},
  {team:'広島',games:4, average:.000, HR:0, RBIs:0, sb:0},
  {team:'中日',games:5, average:.000, HR:0, RBIs:1, sb:0},
  {team:'通算',games:29, average:.174, HR:1, RBIs:3, sb:0},
  ],
  2024: [
      {team:'巨人',games:2, average:.000, HR:0, RBIs:0, sb:0},
      {team:'阪神',games:3, average:.000, HR:0, RBIs:0, sb:0},
      {team:'DeNA',games:9, average:.200, HR:1, RBIs:3, sb:2},
      {team:'広島',games:6, average:.625, HR:1, RBIs:3, sb:0},
      {team:'中日',games:7, average:.500, HR:0, RBIs:0, sb:1},
      {team:'ソフトバンク',games:2, average:.000, HR:0, RBIs:0, sb:0},
      {team:'日本ハム',games:1, average:.333, HR:0, RBIs:0, sb:0},
      {team:'ロッテ',games:2, average:.000, HR:0, RBIs:0, sb:0},
      {team:'オリックス',games:3, average:.500, HR:0, RBIs:0, sb:1},
      {team:'楽天',games:1, average:.000, HR:0, RBIs:0, sb:0},
      {team:'通算',games:36, average:.241, HR:2, RBIs:6, sb:4},
  ]
};


const yamada01statsBody = document.getElementById('yamada01-stats-body');
const yamada01advancedStatsBody = document.getElementById('yamada01-advanced-stats-body');
let yamada01statsChart;  // グラフのインスタンスを保存する変数


function renderStats(stats) {
  yamada01statsBody.innerHTML = ''; // テーブルをクリア

stats.forEach(stat => {
    const row = document.createElement('tr');
    
    row.innerHTML = `
              <td>${stat.年度}</td>
              <td>${stat.チーム名}</td>
              <td>${stat.打率}</td>
              <td>${stat.試合}</td>
              <td>${stat.打席}</td>
              <td>${stat.打数}</td>
              <td>${stat.安打}</td>
              <td>${stat.二塁打}</td>
              <td>${stat.三塁打}</td>
              <td>${stat.本塁打}</td>
              <td>${stat.塁打}</td>
              <td>${stat.打点}</td>
              <td>${stat.得点}</td>
              <td>${stat.三振}</td>
              <td>${stat.四球}</td>
              <td>${stat.死球}</td>
              <td>${stat.犠打}</td>
              <td>${stat.犠飛}</td>
              <td>${stat.盗塁}</td>
              <td>${stat.盗塁死}</td>
              <td>${stat.併殺打}</td>
              <td>${stat.出塁率}</td>
              <td>${stat.長打率}</td>
              <td>${stat.ＯＰＳ}</td>
              <td>${stat.得点圏}</td>
              <td>${stat.失策}</td>
          `;

    yamada01statsBody.appendChild(row);
});
}

function renderPitchingStats(stats) {
const pitchingStatsBody = document.getElementById('pitching-stats-body');
if (!pitchingStatsBody) {
    console.error('pitching-stats-body not found.');
    return; // 処理を中断
}

// テーブルをクリア
pitchingStatsBody.innerHTML = '';

// データを挿入
stats.forEach(stat => {
    const row = document.createElement('tr');
    row.innerHTML = `
        <td>${stat.年度}</td>
        <td>${stat.チーム名}</td>
        <td>${stat.防御率}</td>
        <td>${stat.登板}</td>
        <td>${stat.先発}</td>
        <td>${stat.完投}</td>
        <td>${stat.完封}</td>
        <td>${stat.無四球}</td>
        <td>${stat.交代完了}</td>
        <td>${stat.勝利}</td>
        <td>${stat.敗戦}</td>
        <td>${stat.ホールド}</td>
        <td>${stat.セーブ}</td>
        <td>${stat.勝率}</td>
        <td>${stat.投球回}</td>
        <td>${stat.打者}</td>
        <td>${stat.被安打}</td>
        <td>${stat.被本塁打}</td>
        <td>${stat.奪三振}</td>
        <td>${stat.奪三振率}</td>
        <td>${stat.与四球}</td>
        <td>${stat.暴投}</td>
        <td>${stat.ボーク}</td>
        <td>${stat.失点}</td>
        <td>${stat.自責点}</td>
        <td>${stat.被打率}</td>
        <td>${stat["Ｋ／ＢＢ"] || "N/A"}</td>
        <td>${stat.ＷＨＩＰ}</td>
    `;
    pitchingStatsBody.appendChild(row);
});
console.log('Pitching stats rendered successfully.');
}








function renderAdvancedStats(statsData) {
yamada01advancedStatsBody.innerHTML = ''; // テーブルクリア

for (const [year, stats] of Object.entries(statsData)) {
    const row = document.createElement('tr');
    
    row.innerHTML = `
        <td>${year}</td>
        <td class="clickable" data-stat="kper">${stats.kper}</td>
        <td class="clickable" data-stat="bbper">${stats.bbper}</td>
        <td class="clickable" data-stat="kbb">${stats.kbb}</td>
        <td class="clickable" data-stat="hrper">${stats.hrper}</td>
        <td class="clickable" data-stat="ave">${stats.ave}</td>
        <td class="clickable" data-stat="der">${stats.der}</td>
        <td class="clickable" data-stat="lob">${stats.lob}</td>
        <td class="clickable" data-stat="ramin">${stats.ramin}</td>
        <td class="clickable" data-stat="fipmin">${stats.fipmin}</td>
        <td class="clickable" data-stat="xfipmin">${stats.xfipmin}</td>
        <td class="clickable" data-stat="ra">${stats.ra}</td>
        <td class="clickable" data-stat="fip">${stats.fip}</td>
        <td class="clickable" data-stat="r_f">${stats.r_f}</td>
        <td class="clickable" data-stat="xfip">${stats.xfip}</td>
        <td class="clickable" data-stat="tra">${stats.tra}</td>
    `;

    yamada01advancedStatsBody.appendChild(row);
}

document.querySelectorAll('.clickable').forEach(cell => {
    cell.addEventListener('click', (event) => {
        const statType = event.target.getAttribute('data-stat');
        renderLineChartForStat(statType, yamadaStatsData);
    });
});
}

function renderTeamStats(year) {
  const teamStatsBody = document.getElementById('team-stats-body');
  teamStatsBody.innerHTML = ''; // テーブルクリア

  // 年度ごとのチーム別成績データを取得
  const teamStats = yamadateamStatsByYear[year] || []; // データが存在しない場合空配列

  teamStats.forEach(stat => {
      const row = document.createElement('tr');
      row.innerHTML = `
          <td>${stat.team}</td>
          <td>${stat.games}</td>
          <td>${stat.average.toFixed(3).substring(1)}</td>
          <td>${stat.HR}</td>
          <td>${stat.RBIs}</td>
          <td>${stat.sb}</td>
      `;
      teamStatsBody.appendChild(row);
  });

  const buttons = document.querySelectorAll('#team-stats-buttons-container button');
  buttons.forEach(button => {
      if (button.innerText === year) {
          button.classList.add('active');
      } else {
          button.classList.remove('active');
      }
  });
}



function createYearButtonsForTeamStats() {
  const buttonsContainer = document.getElementById('team-stats-buttons-container');
  buttonsContainer.innerHTML = '';

  Object.keys(yamadateamStatsByYear).forEach(year => {
      const button = document.createElement('button');
      button.innerText = year;
      button.classList.add('team-stats-button');
      button.addEventListener('click', () => renderTeamStats(year));
      buttonsContainer.appendChild(button);
  });
}

document.addEventListener('DOMContentLoaded', () => {
  createYearButtonsForTeamStats(); // ページロード時にボタンを生成
  renderTeamStats('2022');  // デフォルトで2022年のデータを表示
});

function renderLineChartForStat(statType, statsData, comparisonData = null) {
  const labels = Object.keys(statsData); // 年度ラベル
  const data = labels.map(year => statsData[year][statType]);

  let comparisonTrace = null;
  if (comparisonData) {
      const comparisonDataPoints = labels.map(year => comparisonData[year] ? comparisonData[year][statType] : null);
      comparisonTrace = {
          x: labels,
          y: comparisonDataPoints,
          mode: 'lines+markers',
          name: '比較選手', // 比較選手のラベル
          line: { color: 'rgba(255, 99, 132, 1)' }, // 赤色
          marker: { color: 'rgba(255, 99, 132, 0.7)' }
      };
  }

  const playerTrace = {
      x: labels,
      y: data,
      mode: 'lines+markers',
      name: `${statType.toUpperCase()} 山田 哲人`,
      line: { color: 'rgba(144, 238, 144, 1)' }, // 緑色
      marker: { color: 'rgba(144, 238, 144, 0.7)' }
  };

  const layout = {
      title: `${statType.toUpperCase()} の変遷`,
      xaxis: { title: '年度' },
      yaxis: { title: `${statType.toUpperCase()}` },
      margin: { t: 50, r: 30, b: 50, l: 50 },
  };

  const traces = comparisonTrace ? [playerTrace, comparisonTrace] : [playerTrace];

  Plotly.newPlot('yamada01statsChart', traces, layout); // グラフ描画
}






function createYearButtons(statsData) {
const buttonsContainer = document.getElementById('buttons-container');
buttonsContainer.innerHTML = ''; // ボタンクリア
Object.keys(statsData).forEach(year => {
    const button = document.createElement('button');
    button.innerText = year;
    button.addEventListener('click', () => renderChartForYear(year, statsData));
    buttonsContainer.appendChild(button);
});
}

document.addEventListener('DOMContentLoaded', () => {

console.log('DOMContentLoaded event fired.');
  // 「投手成績」をデフォルトで表示
  document.getElementById('pitchingStats').style.display = 'block';
  document.getElementById('battingStats').style.display = 'none';

  
// 投手成績データをレンダリング
renderPitchingStats(yamadapitStats);
  const tooltipPopup = document.getElementById('tooltip-popup');
  const popupTitle = document.getElementById('popup-title');
  const popupContent = document.getElementById('popup-content');
  const popupClose = document.getElementById('popup-close');


  const pitchingStatsBody = document.getElementById('pitching-stats-body');

  if (!pitchingStatsBody) {
      console.error('pitching-stats-body not found.');
      return;
  }

  //th要素にクリックイベント
  document.querySelectorAll('[data-tooltip]').forEach(th => {
      th.addEventListener('click', () => {
          popupTitle.textContent = th.textContent;
          popupContent.textContent = th.getAttribute('data-tooltip');
          tooltipPopup.style.display = 'block';
      });
  });

  // ポップアップ閉じる
  popupClose.addEventListener('click', () => {
      tooltipPopup.style.display = 'none';
  });

  // 領域外クリックしたら閉じる
  window.addEventListener('click', (event) => {
      if (event.target === tooltipPopup) {
          tooltipPopup.style.display = 'none';
      }
  });
  
  renderStats(yamadabatStats);
  renderAdvancedStats(yamadaStatsData);
  createYearButtons(yamadaStatsData);
  renderChartForYear('2012', yamadaStatsData);


});

function switchSubTab(evt, subTabName) {
// すべてのサブタブを非表示
const subTabContents = document.getElementsByClassName('sub-tab-content');
for (let i = 0; i < subTabContents.length; i++) {
    subTabContents[i].style.display = 'none';
}

// すべてのタブリンクから "active" クラスを削除
const subTabLinks = document.getElementsByClassName('sub-tab-link');
for (let i = 0; i < subTabLinks.length; i++) {
    subTabLinks[i].classList.remove('active');
}

// 選択されたタブを表示
document.getElementById(subTabName).style.display = 'block';
evt.currentTarget.classList.add('active');

// 必要なレンダリング処理
if (subTabName === 'pitchingStats') {
    renderPitchingStats(yamadapitStats);
} else if (subTabName === 'battingStats') {
    renderStats(yamadabatStats);
}
}








function openTab(evt, tabName) {
  var i, tabcontent, tablinks;

  // すべてのタブコンテンツを非表示に
  tabcontent = document.getElementsByClassName("tab-content");
  for (i = 0; i < tabcontent.length; i++) {
      tabcontent[i].style.display = "none";
  }

  // タブリンクの "active" クラスを削除
  tablinks = document.getElementsByClassName("tab-link");
  for (i = 0; i < tablinks.length; i++) {
      tablinks[i].className = tablinks[i].className.replace(" active", "");
  }

  // 指定タブを表示、ボタンを "active" クラスに設定
  document.getElementById(tabName).style.display = "block";
  evt.currentTarget.className += " active";
}

// デフォルトで最初のタブを表示
document.addEventListener('DOMContentLoaded', () => {
  document.querySelector('.tab-link').click();
});


// 現在の選手の指標を保存
let currentStat = 'kper'; // 初期状態では "kper" などの指標

// 指標をクリックした時に、グラフを更新するロジック
document.querySelectorAll('.clickable').forEach(cell => {
  cell.addEventListener('click', (event) => {
      const statType = event.target.getAttribute('data-stat');
      currentStat = statType; // 選択された指標を保存
      renderLineChartForStat(statType, yamadaStatsData);
  });
});

